       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MESSAGE PIC X(12) VALUE 'Hello World!'.
       PROCEDURE DIVISION.
           DISPLAY WS-MESSAGE.
           STOP RUN.
